<?xml version="1.0" ?>
<net name="yolo-v2-tiny-tf" version="11">
	<layers>
		<layer id="0" name="image_input" type="Parameter" version="opset1">
			<data shape="1,416,416,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="image_input"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="image_input,image_input:0">
					<dim>1</dim>
					<dim>416</dim>
					<dim>416</dim>
					<dim>3</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,H,W,C]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="image_input/Transpose([0 3 1 2])/value19912791" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="image_input/Transpose([0 3 1 2])/value19912791"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="image_input/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="image_input/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>416</dim>
					<dim>416</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="image_input/scale_copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 3, 3, 3" offset="32" size="864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="image_input/scale_copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="image_input/scale_copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="data_add_1548_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="896" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_1548" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_1548"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="batch_normalization/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_normalization/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_normalization/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="leaky_re_lu/LeakyRelu/weights21042776_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="leaky_re_lu/LeakyRelu/weights21042776" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="leaky_re_lu/LeakyRelu/weights21042776"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="leaky_re_lu/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="leaky_re_lu/LeakyRelu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_re_lu/LeakyRelu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="max_pooling2d/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="max_pooling2d/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="max_pooling2d/MaxPool:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="batch_normalization_1/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 3, 3" offset="930" size="9216"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="batch_normalization_1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="batch_normalization_1/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d_1/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="data_add_15511556_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="10146" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="data_add_15511556" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_15511556"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="batch_normalization_1/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_normalization_1/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_normalization_1/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="leaky_re_lu_1/LeakyRelu/weights20882761_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="leaky_re_lu_1/LeakyRelu/weights20882761" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="leaky_re_lu_1/LeakyRelu/weights20882761"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="leaky_re_lu_1/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="leaky_re_lu_1/LeakyRelu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_re_lu_1/LeakyRelu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="max_pooling2d_1/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="max_pooling2d_1/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="max_pooling2d_1/MaxPool:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="batch_normalization_2/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 3, 3" offset="10210" size="36864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="batch_normalization_2/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="batch_normalization_2/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d_2/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_2/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="data_add_15591564_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="47074" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_add_15591564" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_15591564"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="batch_normalization_2/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_normalization_2/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_normalization_2/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="leaky_re_lu_2/LeakyRelu/weights21122770_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="leaky_re_lu_2/LeakyRelu/weights21122770" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="leaky_re_lu_2/LeakyRelu/weights21122770"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="leaky_re_lu_2/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="leaky_re_lu_2/LeakyRelu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_re_lu_2/LeakyRelu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="max_pooling2d_2/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="max_pooling2d_2/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="max_pooling2d_2/MaxPool:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="batch_normalization_3/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 3, 3" offset="47202" size="147456"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="batch_normalization_3/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="batch_normalization_3/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d_3/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv2d_3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="data_add_15671572_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="194658" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="data_add_15671572" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_15671572"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="batch_normalization_3/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_normalization_3/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_normalization_3/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="leaky_re_lu_3/LeakyRelu/weights21082755_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="leaky_re_lu_3/LeakyRelu/weights21082755" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="leaky_re_lu_3/LeakyRelu/weights21082755"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="leaky_re_lu_3/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="leaky_re_lu_3/LeakyRelu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_re_lu_3/LeakyRelu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="max_pooling2d_3/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="max_pooling2d_3/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="max_pooling2d_3/MaxPool:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="batch_normalization_4/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 128, 3, 3" offset="194914" size="589824"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="batch_normalization_4/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="batch_normalization_4/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d_4/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="conv2d_4/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_4/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="data_add_15751580_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="784738" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="data_add_15751580" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_15751580"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="batch_normalization_4/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_normalization_4/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_normalization_4/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="leaky_re_lu_4/LeakyRelu/weights20922830_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="leaky_re_lu_4/LeakyRelu/weights20922830" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="leaky_re_lu_4/LeakyRelu/weights20922830"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="leaky_re_lu_4/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="leaky_re_lu_4/LeakyRelu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_re_lu_4/LeakyRelu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="max_pooling2d_4/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="max_pooling2d_4/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="max_pooling2d_4/MaxPool:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="batch_normalization_5/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 256, 3, 3" offset="785250" size="2359296"/>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="batch_normalization_5/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="batch_normalization_5/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d_5/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv2d_5/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_5/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_add_15831588_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="3144546" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="data_add_15831588" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_15831588"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="batch_normalization_5/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_normalization_5/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_normalization_5/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="leaky_re_lu_5/LeakyRelu/weights20962803_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="leaky_re_lu_5/LeakyRelu/weights20962803" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="leaky_re_lu_5/LeakyRelu/weights20962803"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="leaky_re_lu_5/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="leaky_re_lu_5/LeakyRelu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_re_lu_5/LeakyRelu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="max_pooling2d_5/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="max_pooling2d_5/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="max_pooling2d_5/MaxPool:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="batch_normalization_6/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 512, 3, 3" offset="3145570" size="9437184"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="batch_normalization_6/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="batch_normalization_6/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d_6/Conv2D/ReadVariableOp:0">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv2d_6/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_6/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="data_add_15911596_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1024, 1, 1" offset="12582754" size="2048"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_15911596" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_15911596"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="batch_normalization_6/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_normalization_6/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_normalization_6/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="leaky_re_lu_6/LeakyRelu/weights21002824_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="leaky_re_lu_6/LeakyRelu/weights21002824" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="leaky_re_lu_6/LeakyRelu/weights21002824"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="leaky_re_lu_6/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="leaky_re_lu_6/LeakyRelu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_re_lu_6/LeakyRelu:0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="batch_normalization_7/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 1024, 3, 3" offset="12584802" size="9437184"/>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="batch_normalization_7/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="batch_normalization_7/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d_7/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv2d_7/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_7/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_add_15991604_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="22021986" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="data_add_15991604" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_15991604"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="batch_normalization_7/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_normalization_7/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_normalization_7/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="leaky_re_lu_7/LeakyRelu/weights21162818_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="928" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="leaky_re_lu_7/LeakyRelu/weights21162818" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="leaky_re_lu_7/LeakyRelu/weights21162818"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="leaky_re_lu_7/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="leaky_re_lu_7/LeakyRelu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_re_lu_7/LeakyRelu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv2d_8/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="425, 512, 1, 1" offset="22023010" size="435200"/>
			<output>
				<port id="0" precision="FP16">
					<dim>425</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv2d_8/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="conv2d_8/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>425</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d_8/Conv2D/ReadVariableOp:0">
					<dim>425</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv2d_8/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_8/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>425</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_8/Conv2D:0">
					<dim>1</dim>
					<dim>425</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv2d_8/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 425, 1, 1" offset="22458210" size="850"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>425</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv2d_8/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="conv2d_8/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>425</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d_8/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>425</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv2d_8/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_8/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>425</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>425</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_8/BiasAdd:0">
					<dim>1</dim>
					<dim>425</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="conv2d_8/BiasAdd/YoloRegion" type="RegionYolo" version="opset1">
			<data anchors="0.57273, 0.677385, 1.87446, 2.06253, 3.33843, 5.47434, 7.88282, 3.52778, 9.77052, 9.16828" axis="1" coords="4" classes="80" end_axis="3" num="5" do_softmax="true" mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_8/BiasAdd/YoloRegion"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>425</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2d_8/BiasAdd/YoloRegion,conv2d_8/BiasAdd/YoloRegion:0">
					<dim>1</dim>
					<dim>71825</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv2d_8/BiasAdd/YoloRegion/sink_port_0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_8/BiasAdd/YoloRegion/sink_port_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71825</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1"/>
		<edge from-layer="5" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="6" from-port="0" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="11" to-port="0"/>
		<edge from-layer="9" from-port="0" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="1"/>
		<edge from-layer="11" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="13" from-port="0" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="1"/>
		<edge from-layer="15" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="16" from-port="0" to-layer="17" to-port="0"/>
